"use client";
import React, {useState} from "react";
import Box from "./components/Box";
// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────
  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return <>
  <section className="mt-8 xl:mt-[81px] xl:w-[1296px] w-[90%] mx-auto">
    <header className="xl:text-[40px] text-[24px] font-bold xl:font-extrabold flex justify-center dark:text-white">
    خدمات <span className="number">تضمین واش</span>
    </header>
    <section className="xl:mt-[40px] mt-4 grid xl:grid-cols-4 xl:grid-rows-2 grid-cols-2 grid-rows-4 gap-4 xl:gap-6">
        <Box  boxIndex={1} title={"شستشوی خودرو"} text={"ارائه روش‌های بهتر برای شستن بدنه خودرو به منظور حفظ زیبایی و تمیزی آن."}/>
        <Box boxIndex={2} title={"پولیش خودرو"} text={"ایجاد جلا و درخشش چشم‌گیر سطح بدنه خودرو با استفاده از پولیش و واکس مخصوص."}/>
        <Box boxIndex={3} title={"موتور شویی"} text={" شستشوی موتور خودرو با استفاده از مواد خاص و رسوب‌گیرهای تخصصی جهت حذف آلودگی‌ها و گرد و غبار."}/>
        <Box boxIndex={4} title={"قلم گیری"} text={"قلم گیری یکی از روش هایی است که میتوان توسط آن خط و خش بوجود آمده را توسط افراد متخضض از بین برد."} />
        <Box boxIndex={5} title={"صفر شویی"} text={"تمیز کردن داخل خودرو از لکه‌ها و کثیفی‌ها با استفاده از دستگاه‌های مخصوص "} />
        <Box boxIndex={6} title={"رفع کدری چراغ"} text={"تکنیسن متخصص ما می توانند با شفاف سازی چراغ های ماشین شما  زیبایی را به ماشین شما برگردانند"} />
        <Box boxIndex={7} title={"واکس صندلی چرم"} text={" شستشوی موتور خودرو با استفاده از مواد خاص و رسوب‌گیرهای تخصصی جهت حذف آلودگی‌ها و گرد و غبار."} />
        <Box boxIndex={8} title={"واکس داشبورد ولاستیک"} text={"قلم گیری یکی از روش هایی است که میتوان توسط آن خط و خش بوجود آمده را توسط افراد متخضض از بین برد."} />
       
    </section>
    </section></>;
}
