"use client";
import React from "react";
import Image from "next/image";
import Card from "../Card";
// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index({ showMoal }) {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return (
    <>
      <section className="mx-auto mt-[40px]  grid  w-full gap-4 xl:gap-y-[42px] xl:w-[1296px] xl:grid-cols-4 xl:gap-x-[24px] ">
        <Card
          image={"/images/article1.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
        <Card
          image={"/images/article2.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />

        <Card
          image={"/images/article3.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
        <Card
          image={"/images/article4.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
         <Card
          image={"/images/article1.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
        <Card
          image={"/images/article2.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />

        <Card
          image={"/images/article3.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
        <Card
          image={"/images/article4.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
         <Card
          image={"/images/article1.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
        <Card
          image={"/images/article2.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />

        <Card
          image={"/images/article3.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
        <Card
          image={"/images/article4.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
         <Card
          image={"/images/article1.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
        <Card
          image={"/images/article2.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />

        <Card
          image={"/images/article3.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
        <Card
          image={"/images/article4.png"}
          title={"تاثیر تمیزی خودرو بر استحکام و طول عمر قطعات"}
          text={
            "تمیزی و نگهداری مناسب خودرو، علاوه بر بهبود ظاهر و استحکام آن، تأثیر بسزایی در ایجاد اعتماد و رضایت مشتریان دارد و... "
          }
          date={"1403/02/02"}
        />
      </section>
    </>
  );
}
