"use client";
import React from "react";

// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return (
    <>
      <section className="h-auto w-full  rounded-[20px] px-4 text-sm dark:bg-white/5 dark:backdrop-blur-sm dark:bg-slider-gradient  dark:border-[1px] dark:border-[#ffffff46] dark:text-white dark:dark:bg-slider-gradient text-[#343434] shadow-[0px_4px_8px_0px_#0000000F,0px_0px_4px_0px_#0000000A] xl:h-full xl:w-[856px] xl:px-[32px] py-[24px]  xl:py-[48px] xl:text-base xl:font-medium leading-[25.13px] xl:leading-[28.72px]">
        <p className="leading-[32px] xl:leading-[32px]">
          همانطور که پیدا کردن یک مکان بدون استفاده از آدرس و نقشه دشوار است ،
          برای گوگل هم دسترسی به همه صفحات سایت بدون نقشه دشوار است. یک نقشه
          سایت (Sitemap) خوب می‌تواند به خزنده های گوگل در کراول کردن سایت و
          هدایت آنها کمک کند.
        </p>
        <section className="mt-[32px]  flex items-center gap-4  font-bold leading-4 text-[#700B97] xl:text-[20px]">
          <span className="h-2 w-2 rounded-full  text-[#700B97]"></span>
          نقشه سایت چیست؟
        </section>
        <p className="mt-[16px]">
          نقشه سایت XML در واقع یک فایل متنی حاوی تمام آدرسهای موجود در سایت
          است. همچنین نقشه سایت میتواند اطلاعات متا ( توضیحات) هر آدرس از سایت
          مانند آخرین بروز رسانی، میزان اهمیت و نحوه ارتباط آن با صفحات دیگر را
          نیز شامل شود. وجود نقشه سایت به موتورهای جستجو کمک می کند تا صفحات
          سایت را به صورت بهتر شناسایی کرده و همچنین از ایجاد صفحات جدید و
          تغییرات در صفحات قدیمی مطلع شود. مهم‌ترین کاری که از نظر سئو، سایت مپ
          می‌کند هدایت خزنده‌ها درون صفحات یک وب‌سایت است تا همه‌ی صفحات شوند.
          تعریف تخصصی‌تر سایت مپ این است: لیستی از آدرس‌های یک وب‌سایت.اما، سایت
          مپ ساختار سایت شما را هم نشان می‌دهد، اینکه چطور صفحات مختلف ساماندهی
          شده و دسته‌بندی‌ها انجام گرفته است.
        </p>
        <p className="mt-4">
          نقشه‌های سایت نمی‌توانند بیش از 50 هزار URL را در خود ثبت کنند. همچنین
          حجم فایل نقشه سایت نیز حداکثر می‌تواند 50 مگابایت باشد. در صورتی که
          نقشه سایتتان از یکی از این دو مورد بزرگتر شود، باید با دسته بندی مطالب
          در نقشه‌های مختلف هریک را بصورت جدا در موتورهای جستجو ثبت کنید. سایت
          شما می‌تواند یک نقشه سایت برای صفحات، یک نقشه برای تصاویر و یک نقشه
          برای ویدیوها داشته باشد. نحوه ثبت نقشه سایت در ادامه توضیح خواهیم داد.
        </p>
        <section className="mt-[30px]  flex items-center gap-4  font-bold leading-4 text-[#700B97] xl:text-[20px]">
          <span className="h-2 w-2 rounded-full bg-[#700B97]"></span>
          چرا به نقشه سایت نیاز داریم؟
        </section>
        <p className="mt-[16px]">
          گوگل محتواهای جدید را توسط ربات‌های خزنده‌ای که وب را بررسی می‌کنند
          کشف می‌کند. وقتی یک صفحه توسط این ربات‌ها بررسی می‌شود، به لینک‌های
          داخلی و خارجی آن توجه می‌شود. اگر یک آدرس URL پیدا شود که در فهرست
          جستجوی آن‌ها نیست، محتوای آن آدرس را فراخوانی می‌کنند و در جای مناسب
          ایندکس می‌کنند. اما گوگل نمی‌تواند تمام محتواهای موجود را به این روش
          پیدا کند. اگر صفحه‌ای وجود داشته باشد که از صفحات شناخته شده به آن
          لینک داخلی داده نشده باشد، گوگل قادر به پیدا کردنش نخواهد بود. اینجاست
          که اهمیت نقشه سایت در سئو مشخص می‌شود. کار سایت مپ این است که به گوگ
          بگوید که کجا و در چه آدرسی می‌توانند مهم‌ترین صفحات آن سایت را پیدا
          کنند تا بتوانند این صفحات را ایندکس کنند.
        </p>
        <section className="mt-[30px]  flex items-center gap-4  font-bold leading-4 text-[#700B97] xl:text-[20px]">
          <span className="h-2 w-2 rounded-full bg-[#700B97]"></span>
          انواع سایت مپ
        </section>
        <p className="mt-[16px]">
          سایت مپ به دو نوع کلی تقسیم بندی می شود: – Visual Sitemap یا سایت مپ
          از نوع HTMاین نوع سایت مپ معمولاً پیش از طراحی سایت ایجاد می‌شود. در
          این نوع از نقشه سایت دسته‌بندی اطلاعات و صفحات، ارتباط صفحات و محتواها
          مشخص می‌شود. همچنین این نوع سایت مپ مخصوص کاربران بازدید کننده وب سایت
          است و به آنها کمک می کند که محتویات صفحات مورد نظرشان را براحتی پیدا
          نمایند. سایت مپ از نوع HTML قابل استفاده در گوگل وبمستر نیست. – XML
          Sitemap یا سایت مپ از نوع XML این نوع سایت مپ زمانی ایجاد میشود که شما
          سایت و صفحات مختلف را ساخته‌اید و آماده‌اید تا آن را به گوگل نشان
          دهید. این نوع نقشه سایت است که راهنمای خزنده‌های گوگل است و در سئو
          سایت بسیار بسیار مهم است. این نوع سایت مپ دارای ساختار سازمان یافته
          شده ای دارد و احتیاج به مشاهده شدن توسط کاربران وب سایت ندارد. سایت مپ
          از نوع XML می تواند در فایل Robots.txt آدرس دهی شود تا به موتورهای
          جستجو کمک نماید راحتر این فایل را پیدا نمایند.
        </p>
      </section>
    </>
  );
}
