"use client";
import React from "react";

// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return (
    <>
      <section className="xl:h-[539px] h-[244px] w-full bg-[url('/images/Header.png')] xl:bg-cover bg-[length:100%_244px] bg-no-repeat text-white  ">
        <section className="mx-auto xl:w-[1296px] w-[332px]">
          <h1 className="xl:pt-[198px] pt-[93px] xl:text-[40px] text-[16px] font-extrabold">
            درباره <span className="number">تضمین‌واش</span>
          </h1>
          <p className="xl:text-[18px] text-[10px] font-medium xl:w-[847px] w-[329px] xl:leading-[38px] leading-[22px] text-justify xl:mt-6 mt-4">تضمین واش یک کسب و کار کارواش در محل میباشد که میتواند به مشتریان در هر کجای استان تهران خدمات رسانی کند. کارواش تضمین واش سفریان آموزش دیده به محل خودروی مشتری اعزام میشوند و با بالا ترین کیفیت خدمات ما را به مشتری ارائه می دهند.</p>
        </section>
      </section>
    </>
  );
}
